OpenFOAM-v1812/tutorials/heatTransfer/chtMultiRegionFoam/windshieldDefrost/0.orig/cabin/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    location    "0/cabin";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (-2 0 0);
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        //type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }
    symmetry
    {
        type            symmetryPlane;
    }
    walls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    cabin_to_ice
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
